Repository: arnaudakotonou97/portfolioVers2
Catalog: translations/locales/*/messages.po
Languages: fr

source: works.role_1
fr: Dévelopeur Frontend

source: countryName
fr: République du Bénin

source: desc.erugis
fr: J'ai conduit le dévelopement frontend des modules de l'application web Uptimise SaaS de concert avec l'équipe backend. Uptimise est un progiciel de gestion des ressources humaines et de la paie. J'ai intégré et développé, à partir de maquettes, le processus d'enrollement des employés avec leurs contrats et leur ancienneté. J'ai ensuite travaillé sur les modules d'avance sur salaire et de congés payés. J'ai également développé le site de présentation d'Uptimise.

source: works.role_2
fr: Dévelopeur Angular

source: desc.dialectai
fr: J'ai dévelopé avec un sénior Full Stack dévelopeur Hotuba en utilisant le framework Ionic. Hotuba est une application mobile servant de place de marché qui met en relation les artisants et ceux qui ont besoin de leurs services. J'ai également développé une application web de bout en bout avec Angular pour entraîner les modèles vocaux des IA de Dialectai.

source: desc.nautilus
fr: J'ai assuré l'intégration des UIs de l'application mobile MyFeda avec NativeScript. J'ai également réalisé des tests de sécurité et aidé à la résolution de bugs sur les plugins Fedapay

source: sumarry.uptimise
fr: Site web de présentation d'Uptimise. Uptimise est une application web SaaS pour la gestion des ressources humaines et des fiches de paie.

source: summary.teska
fr: Une application de réservation, où les voyageurs peuvent réserver des vols, des apartements et des voitures de location.

source: summary.resto
fr: Il s'agit d'un gestionnaire interne de commandes pour les restaurants. Il automatise la génération de reçus et de certaines tâches comptabilité.

source: summary.loto
fr: Une application de jeu de loto où les joueurs gagnent en obtenant un certain nombre de chiffres corrects sur une grille pré-remplie.

source: about.title
fr: A propos

source: hero-cta
fr: Prenons contact

source: hero-hi
fr: Hello, Je m'appelle Femi

source: about-text
fr: A nouveau, bienvenue ! Femi Arnaud AKOTONOU est mon nom complet. <0/>Je suis un jeune dévelopeur frontend avec maintenant un peu plus de 04 ans d'expérience. J'ai consacré ces dernières années à me perfectionner sur les stacks basées sur le Javascript. J'ai des connaissances en dévelopement backend, mais je préfère me tourner vers les solutions BaaS (Backend as a Service) tels que Supabase ou Firebase quand il s'agit de concevoir mes propre backends (histoire d'aller vite :)

source: I enjoyed building this web site and working on the Saas app, I learned a lot about Human resources, payroll and employee's rights and obligations
fr: J'ai apprécié déveloper ce site web et travailler sur l'application Saas. J'ai beaucoup appris sur les ressources humaines, la paie et les droits et obligations des employés.

source: I enjoyed working on this project where I learned about flight booking and its specificities.
fr: J'ai aimé travailler sur ce projet qui m'a permis d'en apprendre davantage sur la réservation de vols et ses spécificités.

source: I have experience with mobile development, with Ionic and NativeScript frameworks. I also had to collaborate on a React Native project in a short time. Last year I didn't spend much time on mobile development but I plan to get back to it with Flutter and ReactNative since they are the most popular frameworks on the market today.
fr: J'ai de l'expérience dans le développement mobile, avec les frameworks Ionic et NativeScript. J'ai également eu à collaborer sur un projet React Native sur une courte période. Je prévois reprendre cette année le développement mobile avec Flutter et ReactNative, car ce sont les frameworks de dévelopement d'applications mobiles les plus en vogues sur le marché aujourd'hui.

source: hero-role
fr: Je suis <0>Dévelopeur Frontend</0>

source: I'm currently working in freelance on <0>ComeUp.com</0>. <1/> I mainly help individuals and startups in the design of their UIs and I also help them build their web apps with React
fr: Je travaille actuellement en tant que freelance sur <0>ComeUp.com</0>. <1/> J'aide principalement les particuliers et les startups à concevoir leurs interfaces utilisateur ; je dévelope également leurs applications web avec React.

source: I'm passively looking for new positions where I can merge my love for code with my love for good looking screens. If you think you've got an opening that I might like, let's connect 🔗
fr: Je suis intéressé par les offres d'entreprises exerçant dans les domaines innovants et proposant une position de dévelopeur frontent dans la région du Québec de préférence ou autre ville au Canada. Si vous pensez avoir un poste à pourvoir qui pourrait me plaire, prenons contact.

source: I've spent the last 4 years building and scaling software for some pretty cool companies. I'm also a great advocate of good user experience and good looking app screens 📱. that's why I help startups and individuals to come up with a prototype of their ideas with the help of figma. Let's connect!
fr: J'ai passé les 04 dernières années à développer et faire évoluer des applications pour des entreprise plutôt cool. 04 années riches d'expérience tant techniques, qu'humaines. Je suis également un fervant défenseur du User Experience sur les produits technologiques 📱. C'est d'ailleur pour cette raison que j'aide les startups et les particuliers à concevoir les UIs, le UX et les prototypes de leurs produits avec FIGMA. Prenons contact !

source: if that's more your speed.
fr: si cela vous convient plus

source: It is a project I contracted on comeUp. I worked on the frontend of the app, it was planned to use Duffel's API to manage flights with their billing.
fr: C'est un projet que j'ai contracté sur comeUp. J'ai travaillé sur le frontend de l'application, il était prévu d'utiliser l'API de Duffel pour gérer les vols avec leur facturation.

source: more
fr: En savoir plus

source: live-project
fr: projet live

source: Loto Esh is a gambling game app. Its goal is to get a certain number of correct numbers on a pre-filled grid
fr: Loto Esh est une application de jeu de hasard. Le but du loto est d'obtenir un certain nombre de chiffres corrects sur une grille pré-remplie.

source: My links
fr: Liens utiles

source: heading-resume-btn
fr: Mon CV

source: or
fr: ou

source: Players buy game cards of 27 boxes divided into 3 lines of 9 boxes.
fr: Les joueurs achètent des cartes de jeu de 27 cases réparties en 3 lignes de 9 cases.

source: Project Links
fr: Liens du projet

source: experience.title
fr: Expérience

source: projects.title
fr: Projets

source: Resto Master is an internal restaurant order and receipt manager.
fr: Resto Master est un gestionnaire de commandes et de reçus, interne aux restaurants.

source: Shoot me an email if you want to connect! You can also find me on
fr: Envoyez-moi un e-mail si vous voulez vous connecter ! Vous pouvez également me trouver sur

source: Teska booking is a booking application that allows travelers to book flights, hotels and rental cars in advance of their trip.
fr: Teska booking est une application de réservations qui permet aux voyageurs de réserver des vols, des hôtels et des voitures de location, à l'avance avant leur voyage

source: The tech stack is based on top of pure React and Mui UI lib for the frontend.
fr: La stack technologique est basée sur React et Mui UI lib pour le frontend.

source: The winnings are proportional to the difficulty of the game mode
fr: Les gains sont proportionnels à la difficulté du mode de jeu.

source: Three playing modes are possible: the quine, the double quine and the full card.
fr: Trois modes de jeu sont possibles : la quine, la double quine et la carte pleine.

source: To win in quine it is enough to have a complete line of good number selected from the abacus among one of the player's cards. In double quine it is necessary to have 2 complete line of good numbers. And finally in the full card mode the player must have all the boxes of the cardboard with the numbers drawn by the abacus
fr: Pour gagner en quine il suffit d'avoir une ligne complète de bons nombres sélectionnés sur le boulier parmi les cartons du joueur. En double quine il faut avoir 2 lignes complètes de bons nombres. Et enfin en mode cartons plein le joueur doit avoir toutes les cases du carton avec les nombres tirés par le boulier.

source: Uptimise makes it easy to manage human resources, leave and absence requests, expense reports, benefits, payroll, employee data.
fr: Uptimise facilite la gestion des ressources humaines, des demandes de congé et d'absence, des notes de frais, des avantages sociaux, de la paie et des données des employés.

source: Use at work
fr: Utilisé en entreprise

source: Use for fun
fr: Sur mes projets

source: Waiters see the available tables in a restaurant, process the order for a table and send it to the kitchen. When the order has been served, the waiter can see the receipt for that order.
fr: Les serveurs voient les tables disponibles dans un restaurant, traitent les commandes d'une table et l'envoient en cuisine. Lorsque la commande a été servie, le serveur peut voir le reçu de cette commande.
